Revit 2026 API

# FailuresAccessorDeleteElements Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void DeleteElements(
	IList<ElementId> idsToDelete
)
```
```vb
Public Sub DeleteElements (
	idsToDelete As IList(Of ElementId)
)
```
```cpp
public:
void DeleteElements(
	IList<ElementId^>^ idsToDelete
)
```
```fsharp
member DeleteElements :
        idsToDelete : IList<ElementId> -> unit
```

#### Parameters

idsToDelete IListElementId

#### Reference

FailuresAccessor Class

Autodesk.Revit.DB Namespace